function Param = Differential_paramet_func( Z_sun, ...
    U_dif_0, N_sut, M_max, u_kp, u_gp, NAME,k_f)
if exist(NAME, 'file')
    delete(NAME);
end
fprintf('\n\n\n\n\n\n \n');
disp(NAME)
% Включаем запись сессии
diary(NAME);
M_max = M_max*max(u_kp)*u_gp;

%% Проверка условия сборки
if (2*Z_sun/N_sut)-round(2*Z_sun/N_sut,0) ~=0
    fprintf('Не выполняется условие сборки см Полунгян т.2 стр 466 \n')
        (2*Z_sun/N_sut)
    round(2*Z_sun/N_sut,0)
    Param = 1
    return
else
    fprintf('Условие сборки выполняется \n')
end

%%% Число зубьев саттелита по формуле из 3т
% Z_sut = round(2 * Re_0 / (m_e * (U_dif_0^2+1)^(1/2)),0);
Z_sut = round(Z_sun/U_dif_0,0);

%%% Исходный внешний модуль примерный  Бойков Жданович Сологуб
m_e = k_f/Z_sut * (M_max/N_sut/U_dif_0^2)^(1/3);

%%% Расчётный модуль торцевой
m_e = round(m_e /0.1)*0.1;

%%%% Расчётное внешнее конусное расстояние
Re_0 = m_e * Z_sun * (1 + 1/U_dif_0^2)^(1/2);

%%% Расчётное передаточное число дифференциала
U_dif_real = Z_sun / Z_sut;

%%%%% Определение параметров дифференциальной передачи
R_e = 0.5*m_e * (Z_sun^2+Z_sut^2)^(1/2);

X_f_int = [1, 1.25, 1.5, 1.75, 2, 2.25, 2.5
           0, 0.045, 0.058, 0.063, 0.063, 0.05, 0.057];
        
X = interp1(X_f_int(1,:), X_f_int(2,:), U_dif_real);

alpha_norm_differential = 22.5;
alpha_norm_differential = alpha_norm_differential * pi/180;

%%% Часть с выводом парамтеров дифференциала
fprintf('------Параметры межосевого дифференциала------------ \n');
fprintf('---Все параметры если не указано отдельно в мм---- \n');
fprintf('----------------------Саттелит -------- Шестерня \n');
fprintf('-------------ИСХОДНОЗАДАННЫЕ ПАРАМЕТРЫ-------- \n');

fprintf('Число саттелитов ------ %.3f   ------- %.3f\n',...
    N_sut , N_sut);
data_0(26,:) = [N_sut , N_sut ];

fprintf('Число зубьев ------ %.3f   ------- %.3f\n',...
    Z_sut , Z_sun);
data_0(1,:) = [Z_sut , Z_sun];

fprintf('Нормальный угоз зацепления  --- %.3f \n',...
    alpha_norm_differential);
data_0(2,:) = [alpha_norm_differential , alpha_norm_differential];

fprintf('Межосевой угол  --------------- %.3f \n',...
    90);
data_0(3,:) = [90*pi/180 , 90*pi/180 ];

fprintf('Торцевой модуль  --------------- %.3f \n',...
    m_e);
data_0(4,:) = [m_e , m_e]/1000;

fprintf('Рабочая высота зуба  --------------- %.3f \n',...
    1.6*m_e);
data_0(5,:) = [1.6*m_e , 1.6*m_e]/1000;

fprintf('Полная высота зуба  --------------- %.3f \n',...
    1.788*m_e);
data_0(6,:) = [1.788*m_e , 1.788*m_e]/1000;

fprintf('--------Параметры полученные в результате расчёта------ \n');

%%% Далее геометрически параметры по методике глеасон 60 годов
%%% Здесь и далее первая большая буква шестерня малая саттелит

%%% Внешние делительные диаметры 
D_e = m_e * Z_sun;
d_e = m_e * Z_sut;

fprintf('Диаметр внешней  ------ %.3f   ------- %.3f \n делительной окружности \n',...
    d_e ,D_e);

data_0(7,:) = [d_e ,D_e]/1000;

%%% Угол делительного конуса
Delta_s = atan(Z_sun/Z_sut);
delta_s = atan(Z_sut/Z_sun);

fprintf('Угол делительного ------ %.3f   ------- %.3f \n конуса, degree\n',...
    delta_s*180/pi ,Delta_s*180/pi);

data_0(8,:) = [delta_s , Delta_s];

%%%% Проверка условия размещения/соседства
if pi/N_sut <= delta_s + 1/Z_sun
    fprintf('Не выполняется условие соседства см Полунгян т.2 стр 466 \n')
    pi/N_sut
    delta_s + 1/Z_sun
    Param = 1
    return
else
    fprintf('Условие соседства выполняется \n')
end

%%% Длина образубщей конуса
A_0 = D_e / 2/sin(Delta_s);

fprintf('Длина образующей --------- %.3f \n делительного конуса\n',...
    A_0);

data_0(9,:) = [A_0 , A_0]/1000;

fprintf('Длина внешнего --------- %.3f \n делительного конуса\n',...
    R_e);

data_0(24,:) = [R_e , R_e]/1000;

%%% Ширина зубчатого зацепления
F = max(ceil(0.3*R_e/0.5)*0.5,0.1);

fprintf('Ширина зубчатого колеса --------- %.3f\n',...
    F);

data_0(10,:) = [F , F]/1000;

%%%  Шаг

p_m = 3.1416 * m_e;

fprintf('Шаг --------------- %.3f\n',...
    p_m);

data_0(11,:) = [p_m , p_m]/1000;

%%% Исходная высота головки зуба
%%% Коэффициент высоты головки зуба полуосевой шестерни обкатывание
K_a = K_a_table_funk(U_dif_real);

%%% Шестерни
a_o_G = K_a * m_e;
a_o_P = 1.6 * m_e - a_o_G;

fprintf('Высота головки зуба ------ %.4f   ------- %.4f\n',...
    a_o_P ,a_o_G);

data_0(12,:) = [a_o_P ,a_o_G]/1000;
%%% Высота ножки зуба
%%% Шестерня

b_o_G = 1.788 * m_e - a_o_G;
b_o_P = 1.788 * m_e - a_o_P;

fprintf('Высота ножки зуба ------ %.4f   ------- %.4f\n',...
   b_o_P ,b_o_G);

data_0(13,:) = [b_o_P ,b_o_G]/1000;

fprintf('Радиальный зазор--------------- %.3f\n',...
    (1.788-1.6)*m_e);
data_0(14,:) = [(1.788-1.6)*m_e ,(1.788-1.6)*m_e]/1000;

%%% Углы ножек зуба
Delta_s_P = atan(b_o_P/A_0);
delta_s_P = atan(b_o_G/A_0);

fprintf('Угол ножки зуба------ %.4f   ------- %.4f\n',...
    delta_s_P*180/pi, Delta_s_P*180/pi);

data_0(15,:) = [delta_s_P, Delta_s_P];

%%% Углы конуса выступов
Delta_s_o_P = Delta_s_P + Delta_s;
delta_s_o_P = delta_s_P + delta_s;

fprintf('Угол конуса выступов ----- %.4f   ------- %.4f\n',...
    delta_s_o_P*180/pi, Delta_s_o_P*180/pi);

data_0(16,:) = [delta_s_o_P, Delta_s_o_P];

%%% Угол конуса впадин
Delta_s_o_R = -Delta_s_P + Delta_s;
delta_s_o_R = -delta_s_P + delta_s;

fprintf('Угол конуса впадин ------ %.4f   ------- %.4f\n',...
    delta_s_o_R*180/pi, Delta_s_o_R*180/pi);

data_0(17,:) = [delta_s_o_R , Delta_s_o_R]/1000;

%%% Диаметр окружности выступов
D_a = D_e + 2 * a_o_G * cos(Delta_s);
d_a = d_e + 2 * a_o_P * cos(delta_s);
fprintf('Диаметр внешней  ------ %.3f   ------- %.3f \n окружности вершин \n',...
    d_a ,D_a);
data_0(18,:) = [d_a ,D_a]/1000;

%%% Расстояние по оси от вершины делительного конуса до наружной кромки
X_0 = d_e/2 - a_o_G*sin(Delta_s);
x_0 = D_e/2 - a_o_P*sin(delta_s);

fprintf('Расстояние до наружной ------ %.3f   ------- %.3f \n кромки венца \n',...
    x_0 ,X_0);

data_0(19,:) = [x_0 ,X_0]/1000;

%%% Коэффициент толщины зуба
K = K_interp_koef_tolsh(U_dif_real^(-1));
%%% Толщина зуба по дуге 
t_G = p_m/2 - (a_o_P-a_o_G)*tan(alpha_norm_differential) - K*m_e;
t_P = p_m - t_G;

fprintf('Толщина зубо по дуге ------ %.3f   ------- %.3f \n',...
    t_P ,t_G);

data_0(20,:) = [t_P ,t_G]/1000;

%%% Боковой зазор
switch true
    case m_e < 5.080
        B = [0.14, 0.18];
        disp('Возможно это направильно')
    case m_e >= 5.080 && m_e < 6.350
        B = [0.152, 0.203];
    case m_e >= 6.350 && m_e < 7.257
        B = [0.178, 0.229];
    case m_e >= 7.257 && m_e < 8.466
        B = [0.203, 0.279];
    case m_e >= 8.466 && m_e < 10.160
        B = [0.254, 0.330];
    case m_e < 5.080 || m_e > 10.160
        disp('Нет реккомндаций думайте сами');
        B = [0, 1]
        disp('Хордовые параметры не корректны');
end

fprintf('Боковой зазор --------------- %.3f --- %.3f\n',...
     B);
 
data_0(21,:) = [B]/1000;

%%% Хордовая толщина зуба
t_c_P = t_P - t_P^3/d_e^2/6 - (B(1) + B(2))/4;
t_c_G = t_G - t_G^3/D_e^2/6 - (B(1) + B(2))/4;
fprintf('Хордовая толщина зуба ------ %.3f   ------- %.3f \n',...
    t_c_P ,t_c_G);
data_0(22,:) = [t_c_P ,t_c_G]/1000;
%%% Хордовая высота зуба
a_c_P = a_o_P + t_c_P^2*cos(delta_s)/4/d_e;
a_c_G = a_o_G + t_c_G^2*cos(Delta_s)/4/D_e;
fprintf('Высота головки зуба ------ %.3f   ------- %.3f \n до хорды \n',...
    a_c_P ,a_c_G);
data_0(23,:) = [a_c_P ,a_c_G]/1000;

fprintf('Крутящий момент ------ %.1f   ------- %.1f \n',...
    M_max, M_max);

fprintf('Расстояие до середины ------ %.3f   ------- %.3f \n пятна констакта  \n',...
    (R_e-F/2)*cos(delta_s),(R_e-F/2)*cos(delta_s));
data_0(25,:) = [ (R_e-F/2)*cos(delta_s) , (R_e-F/2)*cos(delta_s)]/1000;



diary off;
Row_name = {'Саттелит', 'Солнце'};
Col_name = {'Число зубьев',                                 %1
    'Нормальный угол зацепления',                          %2
    'Межосевой угол',                                       %3
    'Торцевой модуль',                                      %4
    'Рабочая высота зуба',                                  %5
    'Полная высота зуба',                                   %6
    'Диаметр внеш дел',                                     %7
    'Угол дел кон',                                          %8
    'Длина образующей',                                     %9
    'Ширина зуб кол',                                       %10
    'Шаг',                                                   %11
    'Высота головки зуба',                                  %12
    'Высота ножки зуба',                                    %13
    'Радиальный зазор',                                     %14
    'Угол ножки зуба',                                      %15
    'Угол конуса выступов',                                 %16
    'Угол конуса впадин',                                   %17
    'Диаметр внешней окр верш',                            %18
    'Расстояние до наружной кромки венца',               %19
    'Толщина зуба по дуге',                                 %20
    'Боковой зазор',                                        %21
    'Хорд толщ зуб',                                        %22
    'Высота головки до хорды',                              %23
    'Длина внешнего делительного конуса',                 %24
    'Расстояие до середины пятна контакта',                %25
    'Число саттелитов'};                                     %26

Param = array2table(data_0, 'RowNames', Col_name, 'VariableNames', Row_name);

end